###################################################################

# Created by write_sdc on Thu Feb  3 12:35:24 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {IMEM_addr[31]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[30]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[29]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[28]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[27]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[26]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[25]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[24]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[23]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[22]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[21]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[20]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[19]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[18]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[17]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[16]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[15]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[14]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[13]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[12]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[11]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[10]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[9]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[8]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[7]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[6]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[5]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[4]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[3]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[2]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[1]}]
set_load -pin_load 3.40189 [get_ports {IMEM_addr[0]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[31]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[30]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[29]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[28]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[27]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[26]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[25]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[24]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[23]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[22]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[21]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[20]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[19]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[18]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[17]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[16]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[15]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[14]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[13]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[12]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[11]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[10]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[9]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[8]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[7]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[6]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[5]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[4]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[3]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[2]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[1]}]
set_load -pin_load 3.40189 [get_ports {DMEM_addr[0]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[31]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[30]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[29]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[28]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[27]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[26]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[25]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[24]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[23]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[22]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[21]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[20]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[19]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[18]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[17]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[16]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[15]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[14]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[13]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[12]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[11]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[10]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[9]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[8]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[7]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[6]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[5]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[4]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[3]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[2]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[1]}]
set_load -pin_load 3.40189 [get_ports {DMEM_data[0]}]
set_load -pin_load 3.40189 [get_ports IMEM_readEn]
set_load -pin_load 3.40189 [get_ports DMEM_readEn]
set_load -pin_load 3.40189 [get_ports DMEM_writeEn]
create_clock [get_ports clk]  -name MYCLK  -period 10  -waveform {0 5}
set_clock_uncertainty 0.07  [get_clocks MYCLK]
set_input_delay -clock MYCLK  -max 0.5  [get_ports rstN]
set_input_delay -clock MYCLK  -max 0.5  [get_ports pcSel]
set_input_delay -clock MYCLK  -max 0.5  [get_ports pcEn]
set_input_delay -clock MYCLK  -max 0.5  [get_ports pcClearN]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[31]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[30]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[29]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[28]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[27]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[26]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[25]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[24]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[23]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[22]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[21]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[20]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[19]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[18]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[17]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[16]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[15]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[14]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[13]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[12]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[11]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[10]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[9]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[8]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[7]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[6]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[5]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[4]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[3]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[2]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[1]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {pcIN[0]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[31]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[30]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[29]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[28]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[27]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[26]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[25]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[24]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[23]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[22]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[21]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[20]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[19]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[18]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[17]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[16]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[15]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[14]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[13]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[12]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[11]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[10]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[9]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[8]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[7]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[6]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[5]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[4]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[3]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[2]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[1]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_out[0]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[31]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[30]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[29]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[28]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[27]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[26]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[25]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[24]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[23]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[22]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[21]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[20]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[19]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[18]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[17]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[16]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[15]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[14]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[13]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[12]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[11]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[10]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[9]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[8]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[7]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[6]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[5]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[4]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[3]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[2]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[1]}]
set_input_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_out[0]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[31]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[30]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[29]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[28]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[27]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[26]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[25]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[24]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[23]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[22]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[21]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[20]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[19]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[18]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[17]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[16]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[15]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[14]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[13]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[12]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[11]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[10]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[9]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[8]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[7]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[6]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[5]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[4]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[3]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[2]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[1]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {IMEM_addr[0]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[31]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[30]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[29]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[28]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[27]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[26]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[25]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[24]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[23]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[22]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[21]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[20]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[19]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[18]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[17]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[16]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[15]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[14]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[13]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[12]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[11]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[10]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[9]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[8]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[7]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[6]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[5]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[4]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[3]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[2]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[1]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_addr[0]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[31]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[30]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[29]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[28]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[27]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[26]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[25]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[24]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[23]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[22]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[21]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[20]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[19]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[18]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[17]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[16]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[15]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[14]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[13]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[12]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[11]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[10]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[9]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[8]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[7]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[6]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[5]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[4]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[3]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[2]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[1]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports {DMEM_data[0]}]
set_output_delay -clock MYCLK  -max 0.5  [get_ports IMEM_readEn]
set_output_delay -clock MYCLK  -max 0.5  [get_ports DMEM_readEn]
set_output_delay -clock MYCLK  -max 0.5  [get_ports DMEM_writeEn]
